# OrientToView Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BaseImportOptions..::..OrientToView Property
BaseImportOptions Class See Also
---
Place the import at the same orientation as the view that was passed into the import method. This option can only be used when not importing into a single view.(i.e. ThisViewOnly is set to false)
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool OrientToView { get; set; }
```

Visual Basic
---
```text
Public Property OrientToView As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool OrientToView {
	bool get ();
	void set (bool value);
}
```

# See Also
BaseImportOptions Class
Autodesk.Revit.DB Namespace